# GutterMaterialParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..GutterMaterialParam Property
ParameterTypeId Class See Also
---
"Material"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId GutterMaterialParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GutterMaterialParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ GutterMaterialParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace